In [33]:
import pandas as pd
import numpy as np

In [34]:
data = [{'MPG':14, 'Cylinders':8, 'Cubichnes':350, 'HP':165},
        {'MPG':31.9, 'Cylinders':4, 'Cubichnes':89, 'HP':71},
        {'MPG':517, 'Cylinders':8, 'Cubichnes':302, 'HP':140},
        {'MPG':15, 'Cubichnes':400, 'HP':150},
        {'MPG':30.5},
        {'MPG':23, 'Cubichnes':250, 'HP':125},
        {'MPG':13, 'Cubichnes':351, 'HP':158},
        {'MPG':14, 'Cylinders':8, 'HP':215},
        {'MPG':25.4, 'Cylinders':5, 'HP':77},
        {'MPG':37.7, 'Cylinders':4, 'Cubichnes':89, 'HP':62}]

df = pd.DataFrame(data, index=['Yaris','Ayla','Wuling','Kijang','Avanza','Datsun','Fiat','Fred','Jazz','Terios'])
df

          MPG  Cylinders  Cubichnes     HP
Yaris    14.0        8.0      350.0  165.0
Ayla     31.9        4.0       89.0   71.0
Wuling  517.0        8.0      302.0  140.0
Kijang   15.0        NaN      400.0  150.0
Avanza   30.5        NaN        NaN    NaN
Datsun   23.0        NaN      250.0  125.0
Fiat     13.0        NaN      351.0  158.0
Fred     14.0        8.0        NaN  215.0
Jazz     25.4        5.0        NaN   77.0
Terios   37.7        4.0       89.0   62.0

#### Mengganti Missing value dengan nilai rata rata pada kolom "Cylinders" dan "Cubinchnes"

In [35]:
df.isna().sum()

MPG          0
Cylinders    4
Cubichnes    3
HP           1
dtype: int64

In [36]:
rata_silinder = df["Cylinders"].mean()
rata_silinder

6.166666666666667

In [37]:
df["Cylinders"] = df['Cylinders'].fillna(rata_silinder)
df

          MPG  Cylinders  Cubichnes     HP
Yaris    14.0   8.000000      350.0  165.0
Ayla     31.9   4.000000       89.0   71.0
Wuling  517.0   8.000000      302.0  140.0
Kijang   15.0   6.166667      400.0  150.0
Avanza   30.5   6.166667        NaN    NaN
Datsun   23.0   6.166667      250.0  125.0
Fiat     13.0   6.166667      351.0  158.0
Fred     14.0   8.000000        NaN  215.0
Jazz     25.4   5.000000        NaN   77.0
Terios   37.7   4.000000       89.0   62.0

In [38]:
rata_kabin = df["Cubichnes"].mean()
rata_kabin

261.57142857142856

In [39]:
df["Cubichnes"] = df['Cubichnes'].fillna(rata_kabin)
df

          MPG  Cylinders   Cubichnes     HP
Yaris    14.0   8.000000  350.000000  165.0
Ayla     31.9   4.000000   89.000000   71.0
Wuling  517.0   8.000000  302.000000  140.0
Kijang   15.0   6.166667  400.000000  150.0
Avanza   30.5   6.166667  261.571429    NaN
Datsun   23.0   6.166667  250.000000  125.0
Fiat     13.0   6.166667  351.000000  158.0
Fred     14.0   8.000000  261.571429  215.0
Jazz     25.4   5.000000  261.571429   77.0
Terios   37.7   4.000000   89.000000   62.0

#### Atau kita bisa mengganti missing value demgan menghapus baris tersebut

a = data_contoh.dropna()
a

In [11]:
np.random.normal(loc=5, scale=1.0, size=12)

array([3.0283899 , 5.10319202, 4.56089867, 5.04518612, 5.97832836,
       5.28294006, 6.23320124, 5.48260052, 5.1712212 , 5.55724469,
       4.74563467, 6.17044864])

In [60]:
employee = pd.read_csv("C:/Dokumen/1. SAINS DATA/SEMESTER 4/Data Mining/Tugas/P3/data P3.csv")
print(employee)

   sr.no                          Name   Address         Phone    Status  \
0      1         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1      2  Citra Amelia Intan Permadani   Surbaya  2.108301e+10    Client
2      3          Sandria Amelia Putri    Madiun           NaN       NaN
3      4       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4      5           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
5      6           Naomi Dwi Anggraini   Jombang  2.108301e+10  Intrenal
6      7           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7      8     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal
8      9       Mohammad Nizar Riswanda    Blitar  2.108301e+10       NaN
9     10          Amalia Nur Ramadhani    Blitar  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
2     Sandria@text.com  3.9
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
5       Naomi@text.com  NaN
6      Adelia@text.com  3.6
7  Dwinggrit@text.com   3.6
8                  NaN  3.8
9      Amalia@text.com  NaN

#### Menghapus data yang berulang dengan tetap mempertahankan salah satu baris (baris pertama)

In [61]:
employee.drop_duplicates(subset="Name", keep = 'first', inplace = True)
print(employee)

   sr.no                          Name   Address         Phone    Status  \
0      1         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1      2  Citra Amelia Intan Permadani   Surbaya  2.108301e+10    Client
2      3          Sandria Amelia Putri    Madiun           NaN       NaN
3      4       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4      5           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
5      6           Naomi Dwi Anggraini   Jombang  2.108301e+10  Intrenal
7      8     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal
8      9       Mohammad Nizar Riswanda    Blitar  2.108301e+10       NaN
9     10          Amalia Nur Ramadhani    Blitar  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
2     Sandria@text.com  3.9
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
5       Naomi@text.com  NaN
7  Dwinggrit@text.com   3.6
8                  NaN  3.8
9      Amalia@text.com  NaN

Fungsi "drop_duplicates" digunakan untuk menghapus baris berulang. Parameter yang ada meliputi:
1. subset: menetapkan nama kolom ke parameter subset untuk memeriksa nilai berulang.
    Secara default, parameter ini akan memeriksa semua kolom.
     keep: untuk menyimpan baris pertama (5)

inplace: Boolean case (True or False)
    dengan memilih "True" maka perintah akan dijalankan dengan menghapus nilai selain baris pertama

In [62]:
missing = employee.isnull()
print(missing)

   sr.no   Name  Address  Phone  Status  email    IPK
0  False  False    False  False   False  False  False
1  False  False    False  False   False  False  False
2  False  False    False   True    True  False  False
3  False  False    False  False   False  False  False
4  False  False    False  False   False  False  False
5  False  False    False  False   False  False   True
7  False  False    False  False   False  False  False
8  False  False    False  False    True   True  False
9  False  False    False  False   False  False   True

In [63]:
employee = employee.dropna(axis=0)
print(employee)

   sr.no                          Name   Address         Phone    Status  \
0      1         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1      2  Citra Amelia Intan Permadani   Surbaya  2.108301e+10    Client
3      4       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4      5           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7      8     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
7  Dwinggrit@text.com   3.6

#### Penggantian nama kolom

In [64]:
employee_kolom = ['sr.no','Employee_Name', 'Address', 'Phone(WA)','Project_Type','Email_id']
print(employee_kolom)

['sr.no', 'Employee_Name', 'Address', 'Phone(WA)', 'Project_Type', 'Email_id']

#### Penghapusan data yang tidak relevan dan penghapusan kolom

In [65]:
del employee['sr.no']
print(employee)

                           Name   Address         Phone    Status  \
0         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1  Citra Amelia Intan Permadani   Surbaya  2.108301e+10    Client
3       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
7  Dwinggrit@text.com   3.6

#### Penanganan Typo atau kesalahan penulisan

In [66]:
employee['Address'] = employee['Address'].str.replace('Surbaya','Surabaya')
print(employee)

                           Name   Address         Phone    Status  \
0         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1  Citra Amelia Intan Permadani  Surabaya  2.108301e+10    Client
3       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
7  Dwinggrit@text.com   3.6

In [67]:
print(employee.fillna({'Status': 'External'}))

                           Name   Address         Phone    Status  \
0         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1  Citra Amelia Intan Permadani  Surabaya  2.108301e+10    Client
3       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
7  Dwinggrit@text.com   3.6

In [69]:
from statistics import mean
employee = pd.read_csv("C:/Dokumen/1. SAINS DATA/SEMESTER 4/Data Mining/Tugas/P3/data P3.csv")
print(employee)

   sr.no                          Name   Address         Phone    Status  \
0      1         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1      2  Citra Amelia Intan Permadani   Surbaya  2.108301e+10    Client
2      3          Sandria Amelia Putri    Madiun           NaN       NaN
3      4       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4      5           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
5      6           Naomi Dwi Anggraini   Jombang  2.108301e+10  Intrenal
6      7           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7      8     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal
8      9       Mohammad Nizar Riswanda    Blitar  2.108301e+10       NaN
9     10          Amalia Nur Ramadhani    Blitar  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
2     Sandria@text.com  3.9
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
5       Naomi@text.com  NaN
6      Adelia@text.com  3.6
7  Dwinggrit@text.com   3.6
8                  NaN  3.8
9      Amalia@text.com  NaN

In [70]:
print(employee)
a = np.mean(employee['IPK'])
print(a)

   sr.no                          Name   Address         Phone    Status  \
0      1         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1      2  Citra Amelia Intan Permadani   Surbaya  2.108301e+10    Client
2      3          Sandria Amelia Putri    Madiun           NaN       NaN
3      4       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4      5           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
5      6           Naomi Dwi Anggraini   Jombang  2.108301e+10  Intrenal
6      7           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7      8     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal
8      9       Mohammad Nizar Riswanda    Blitar  2.108301e+10       NaN
9     10          Amalia Nur Ramadhani    Blitar  2.108301e+10  Internal

                 email  IPK
0      Mareta@text.com  3.5
1       Citra@text.com  3.8
2     Sandria@text.com  3.9
3      Amanda@text.com  4.0
4      Adelia@text.com  3.7
5       Naomi@text.com  NaN
6      Adelia@text.com  3.6
7  Dwinggrit@text.com   3.6
8                  NaN  3.8
9      Amalia@text.com  NaN
3.7375000000000003

In [71]:
print(employee.fillna({'IPK': a}))

   sr.no                          Name   Address         Phone    Status  \
0      1         Mareta Putri Wardhana  Surabaya  2.108301e+10    Client
1      2  Citra Amelia Intan Permadani   Surbaya  2.108301e+10    Client
2      3          Sandria Amelia Putri    Madiun           NaN       NaN
3      4       Amanda Ayu Dewi Lestari    Madiun  2.108301e+10    Client
4      5           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
5      6           Naomi Dwi Anggraini   Jombang  2.108301e+10  Intrenal
6      7           Adelia Azizatul Haq   Jombang  2.108301e+10  Internal
7      8     Dwinggrit Oktaviani Putri    Kediri  2.108301e+10  Internal
8      9       Mohammad Nizar Riswanda    Blitar  2.108301e+10       NaN
9     10          Amalia Nur Ramadhani    Blitar  2.108301e+10  Internal

                 email     IPK
0      Mareta@text.com  3.5000
1       Citra@text.com  3.8000
2     Sandria@text.com  3.9000
3      Amanda@text.com  4.0000
4      Adelia@text.com  3.7000
5       Naomi@text.com  3.7375
6      Adelia@text.com  3.6000
7  Dwinggrit@text.com   3.6000
8                  NaN  3.8000
9      Amalia@text.com  3.7375

In [72]:
modus = employee['Address'].mode()
print(modus)

0    Jombang
Name: Address, dtype: object